RoboBachelor/RoboMaster-Balance-Car/Imu.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32F4
ProjectManager.MainLocation=Src
USB_DEVICE.CLASS_NAME_FS=CDC
Dma.SPI5_RX.1.Instance=DMA2_Stream3
RCC.CortexFreq_Value=168000000
PH12.Signal=S_TIM5_CH3
TIM5.Channel-Output\ Compare4\ CH4=TIM_CHANNEL_4
ProjectManager.KeepUserCode=true
PE11.GPIOParameters=GPIO_Label
Mcu.UserName=STM32F427IIHx
PH10.Signal=S_TIM5_CH1
PE11.GPIO_Label=LED_RED
USART1.BaudRate=100000
Dma.SPI5_TX.2.MemInc=DMA_MINC_ENABLE
RCC.PLLCLKFreq_Value=168000000
RCC.PLLQCLKFreq_Value=48000000
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-MX_DMA_Init-DMA-false-HAL-true,3-SystemClock_Config-RCC-false-HAL-true,4-MX_SPI5_Init-SPI5-false-HAL-true,5-MX_USART6_UART_Init-USART6-false-HAL-true,6-MX_USB_DEVICE_Init-USB_DEVICE-false-HAL-false,7-MX_USART1_UART_Init-USART1-false-HAL-true,8-MX_CAN1_Init-CAN1-false-HAL-true,9-MX_TIM5_Init-TIM5-false-HAL-true
SH.S_TIM5_CH2.0=TIM5_CH2,PWM Generation2 CH2
PA11.Mode=Device_Only
RCC.RTCFreq_Value=32000
PB0.GPIO_Label=LCD_RST
PA6.GPIO_Label=LCD_BLK
USB_DEVICE.VirtualMode-CDC_FS=Cdc
USART1.IPParameters=VirtualMode,BaudRate,Parity
PinOutPanel.RotationAngle=0
PB3.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x2000
VP_FREERTOS_VS_CMSIS_V2.Mode=CMSIS_V2
RCC.SAI_BClocksFreq_Value=24500000
Mcu.IP4=RCC
RCC.FCLKCortexFreq_Value=168000000
Mcu.IP5=SPI5
Mcu.IP2=FREERTOS
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:false\:false\:false\:false
Mcu.IP3=NVIC
Mcu.IP0=CAN1
Mcu.IP1=DMA
PA12.Signal=USB_OTG_FS_DP
Dma.SPI5_TX.2.Direction=DMA_MEMORY_TO_PERIPH
Mcu.UserConstants=
PF7.Signal=SPI5_SCK
Mcu.ThirdPartyNb=0
FREERTOS.configUSE_STATS_FORMATTING_FUNCTIONS=1
PH0/OSC_IN.Mode=HSE-External-Oscillator
RCC.HCLKFreq_Value=168000000
Mcu.IPNb=12
RCC.I2SClocksFreq_Value=192000000
ProjectManager.PreviousToolchain=STM32CubeIDE
RCC.APB2TimFreq_Value=168000000
PB6.Signal=USART1_TX
RCC.VcooutputI2S=192000000
Dma.SPI5_RX.1.FIFOMode=DMA_FIFOMODE_DISABLE
PB6.Mode=Asynchronous
PH1/OSC_OUT.Signal=RCC_OSC_OUT
SH.S_TIM5_CH3.0=TIM5_CH3,PWM Generation3 CH3
Mcu.Pin6=PB7
PD0.Signal=CAN1_RX
Mcu.Pin7=PB6
Mcu.Pin8=PD0
Mcu.Pin9=PA12
RCC.VCOSAIOutputFreq_Value=98000000
Dma.SPI5_TX.2.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
FREERTOS.IPParameters=Tasks01,configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY,configUSE_TRACE_FACILITY,configUSE_STATS_FORMATTING_FUNCTIONS,configGENERATE_RUN_TIME_STATS,INCLUDE_vTaskDelayUntil,FootprintOK
RCC.AHBFreq_Value=168000000
Dma.USART1_RX.0.Priority=DMA_PRIORITY_MEDIUM
Mcu.Pin0=PB8
Mcu.Pin1=PG14
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PB3
Mcu.Pin3=PA14
Mcu.Pin4=PA13
Mcu.Pin5=PB9
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=12000000
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
Mcu.IP10=USB_DEVICE
NVIC.SysTick_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:true
Mcu.IP11=USB_OTG_FS
PG14.Mode=Asynchronous
Dma.SPI5_TX.2.MemDataAlignment=DMA_MDATAALIGN_BYTE
ProjectManager.FirmwarePackage=STM32Cube FW_F4 V1.25.2
MxDb.Version=DB.6.0.10
PB0.GPIOParameters=GPIO_Speed,GPIO_Label
PF9.Mode=Full_Duplex_Master
ProjectManager.BackupPrevious=false
RCC.VCOInputFreq_Value=2000000
Dma.SPI5_TX.2.Priority=DMA_PRIORITY_VERY_HIGH
PA14.Mode=Serial_Wire
Dma.SPI5_RX.1.Mode=DMA_NORMAL
PI0.Signal=S_TIM5_CH4
File.Version=6
PB3.GPIOParameters=GPIO_Speed,GPIO_Label
PB7.Signal=USART1_RX
PF8.Mode=Full_Duplex_Master
PB8.Locked=true
NVIC.PendSV_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:false
SH.S_TIM5_CH2.ConfNb=1
Dma.USART1_RX.0.MemInc=DMA_MINC_ENABLE
PH1/OSC_OUT.Mode=HSE-External-Oscillator
Dma.RequestsNb=3
ProjectManager.HalAssertFull=false
PB0.Locked=true
ProjectManager.ProjectName=Imu
RCC.MCO2PinFreq_Value=168000000
CAN1.Prescaler=3
PB9.Signal=GPIO_Output
Mcu.Package=UFBGA176
SPI5.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_128
PA6.Signal=GPIO_Output
PA7.Locked=true
NVIC.TimeBase=TIM7_IRQn
SH.GPXTI8.0=GPIO_EXTI8
USART6.VirtualMode=VM_ASYNC
Dma.SPI5_RX.1.MemInc=DMA_MINC_ENABLE
NVIC.OTG_FS_IRQn=true\:1\:0\:true\:false\:true\:false\:false\:true
ProjectManager.ToolChainLocation=
RCC.LSI_VALUE=32000
SH.GPXTI8.ConfNb=1
Dma.USART1_RX.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode
NVIC.TimeBaseIP=TIM7
FREERTOS.FootprintOK=true
USB_OTG_FS.VirtualMode=Device_Only
PF8.Signal=SPI5_MISO
VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS.Signal=USB_DEVICE_VS_USB_DEVICE_CDC_FS
SPI5.CalculateBaudRate=656.25 KBits/s
Dma.USART1_RX.0.FIFOMode=DMA_FIFOMODE_DISABLE
RCC.APB2CLKDivider=RCC_HCLK_DIV2
PB9.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
Dma.SPI5_TX.2.Instance=DMA2_Stream4
NVIC.DMA2_Stream2_IRQn=true\:3\:0\:true\:false\:true\:false\:false\:true
Dma.Request2=SPI5_TX
PF14.Signal=GPIO_Output
Dma.Request1=SPI5_RX
RCC.APB1TimFreq_Value=84000000
FREERTOS.configGENERATE_RUN_TIME_STATS=1
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
SH.S_TIM5_CH1.0=TIM5_CH1,PWM Generation1 CH1
Dma.USART1_RX.0.Mode=DMA_CIRCULAR
USB_OTG_FS.IPParameters=VirtualMode
PA6.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
NVIC.USART1_IRQn=true\:3\:0\:true\:false\:true\:false\:true\:true
Dma.Request0=USART1_RX
CAN1.CalculateTimeBit=999.99
Dma.SPI5_RX.1.Direction=DMA_PERIPH_TO_MEMORY
Dma.USART1_RX.0.Instance=DMA2_Stream2
NVIC.TIM7_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
SPI5.VirtualType=VM_MASTER
ProjectManager.CustomerFirmwarePackage=
Dma.SPI5_TX.2.FIFOMode=DMA_FIFOMODE_DISABLE
RCC.SAI_AClocksFreq_Value=24500000
PB3.Locked=true
CAN1.CalculateTimeQuantum=71.42857142857143
PB3.GPIO_Label=LCD_SCLK
PA6.GPIOParameters=GPIO_Speed,GPIO_Label
ProjectManager.ProjectFileName=Imu.ioc
FREERTOS.Tasks01=defaultTask,24,128,StartDefaultTask,Default,NULL,Dynamic,NULL,NULL;LED_Blink_Task,16,128,LED_Task,As external,NULL,Dynamic,NULL,NULL;INS_Update_Task,48,1024,INS_Task,As external,NULL,Dynamic,NULL,NULL;Gimbal_Control,40,512,Gimbal_Task,As external,NULL,Dynamic,NULL,NULL;LCD_Refresh,8,512,LCD_Task,As external,NULL,Dynamic,NULL,NULL
PB8.GPIOParameters=GPIO_Label
TIM5.IPParameters=Channel-PWM Generation1 CH1,Channel-PWM Generation2 CH2,Channel-PWM Generation3 CH3,Prescaler,Period,Channel-Output Compare4 CH4
Dma.USART1_RX.0.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
PB9.GPIO_Label=LCD_DC
Mcu.PinsNb=31
PH11.Signal=S_TIM5_CH2
ProjectManager.NoMain=false
USB_DEVICE.VirtualModeFS=Cdc_FS
USART6.IPParameters=VirtualMode
NVIC.SavedSvcallIrqHandlerGenerated=true
PG9.Signal=USART6_RX
VP_SYS_VS_tim7.Mode=TIM7
CAN1.IPParameters=CalculateTimeQuantum,Prescaler,SJW,CalculateTimeBit,CalculateBaudRate,BS1,BS2
FREERTOS.INCLUDE_vTaskDelayUntil=1
CAN1.CalculateBaudRate=1000000
PG9.Mode=Asynchronous
PD1.Signal=CAN1_TX
ProjectManager.DefaultFWLocation=true
RCC.VCOSAIOutputFreq_ValueQ=24500000
PF14.GPIO_Label=LED_GREEN
TIM5.Channel-PWM\ Generation3\ CH3=TIM_CHANNEL_3
ProjectManager.DeletePrevious=true
Dma.SPI5_TX.2.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode
RCC.APB1CLKDivider=RCC_HCLK_DIV4
USB_DEVICE.IPParameters=VirtualMode-CDC_FS,VirtualModeFS,CLASS_NAME_FS
SPI5.Mode=SPI_MODE_MASTER
PinOutPanel.CurrentBGAView=Top
RCC.FamilyName=M
Dma.SPI5_TX.2.PeriphInc=DMA_PINC_DISABLE
NVIC.USART6_IRQn=true\:4\:0\:true\:false\:true\:false\:true\:true
PB9.GPIOParameters=GPIO_Speed,GPIO_Label
PB0.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
PA13.Signal=SYS_JTMS-SWDIO
PF7.Mode=Full_Duplex_Master
PB8.GPIO_Label=MPU6500-INT
CAN1.BS2=CAN_BS2_5TQ
PF6.Signal=GPIO_Output
CAN1.BS1=CAN_BS1_8TQ
ProjectManager.TargetToolchain=STM32CubeIDE
FREERTOS.configUSE_TRACE_FACILITY=1
PF6.Locked=true
Dma.USART1_RX.0.Direction=DMA_PERIPH_TO_MEMORY
VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS.Mode=CDC_FS
USART1.Parity=PARITY_EVEN
SH.S_TIM5_CH3.ConfNb=1
RCC.VcooutputI2SQ=192000000
PB9.Locked=true
ProjectManager.RegisterCallBack=
NVIC.DMA2_Stream3_IRQn=true\:2\:0\:true\:false\:true\:false\:false\:true
PE11.Signal=GPIO_Output
RCC.LSE_VALUE=32768
Dma.USART1_RX.0.PeriphInc=DMA_PINC_DISABLE
RCC.VCOI2SOutputFreq_Value=384000000
PG14.Signal=USART6_TX
board=Imu
RCC.VCOOutputFreq_Value=336000000
ProjectManager.LastFirmware=true
PF14.GPIOParameters=GPIO_Label
PD1.Mode=CAN_Activate
PA7.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
VP_SYS_VS_tim7.Signal=SYS_VS_tim7
PH0/OSC_IN.Signal=RCC_OSC_IN
NVIC.SavedSystickIrqHandlerGenerated=true
RCC.APB2Freq_Value=84000000
MxCube.Version=6.1.2
Dma.SPI5_RX.1.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
Mcu.Pin30=VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS
RCC.EthernetFreq_Value=168000000
Dma.USART1_RX.0.MemDataAlignment=DMA_MDATAALIGN_BYTE
Dma.SPI5_RX.1.PeriphInc=DMA_PINC_DISABLE
SH.S_TIM5_CH4.0=TIM5_CH4,Output Compare4 CH4
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PF14.Locked=true
SH.S_TIM5_CH4.ConfNb=1
PA13.Mode=Serial_Wire
ProjectManager.FreePins=false
RCC.IPParameters=48MHZClocksFreq_Value,AHBFreq_Value,APB1CLKDivider,APB1Freq_Value,APB1TimFreq_Value,APB2CLKDivider,APB2Freq_Value,APB2TimFreq_Value,CortexFreq_Value,EthernetFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI_VALUE,I2SClocksFreq_Value,LSE_VALUE,LSI_VALUE,MCO2PinFreq_Value,PLLCLKFreq_Value,PLLM,PLLN,PLLQ,PLLQCLKFreq_Value,RTCFreq_Value,RTCHSEDivFreq_Value,SAI_AClocksFreq_Value,SAI_BClocksFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,VCOI2SOutputFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VCOSAIOutputFreq_Value,VCOSAIOutputFreq_ValueQ,VcooutputI2S,VcooutputI2SQ
PE11.Locked=true
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F427I(G-I)Hx
PD0.Mode=CAN_Activate
Mcu.Pin26=PB0
Mcu.Pin27=PF14
NVIC.SavedPendsvIrqHandlerGenerated=true
NVIC.DMA2_Stream4_IRQn=true\:3\:0\:true\:false\:true\:false\:false\:true
RCC.RTCHSEDivFreq_Value=6000000
Mcu.Pin24=PE11
ProjectManager.UnderRoot=true
Mcu.Pin25=PA7
Mcu.IP8=USART1
VP_FREERTOS_VS_CMSIS_V2.Signal=FREERTOS_VS_CMSIS_V2
CAN1.SJW=CAN_SJW_1TQ
Mcu.IP9=USART6
Mcu.Pin28=VP_FREERTOS_VS_CMSIS_V2
Mcu.IP6=SYS
Mcu.Pin29=VP_SYS_VS_tim7
Mcu.IP7=TIM5
ProjectManager.CoupleFile=true
RCC.48MHZClocksFreq_Value=48000000
PB3.Signal=GPIO_Output
TIM5.Channel-PWM\ Generation2\ CH2=TIM_CHANNEL_2
RCC.SYSCLKFreq_VALUE=168000000
FREERTOS.configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY=2
Mcu.Pin22=PH10
Mcu.Pin23=PA6
Mcu.Pin20=PF8
PA7.GPIO_Label=LCD_SDIN
Mcu.Pin21=PH11
PA12.Mode=Device_Only
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=true
TIM5.Prescaler=84-1
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
USART1.VirtualMode=VM_ASYNC
ProjectManager.CompilerOptimize=3
PB7.Mode=Asynchronous
PA11.Signal=USB_OTG_FS_DM
NVIC.EXTI9_5_IRQn=true\:2\:0\:true\:false\:true\:false\:true\:true
TIM5.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
PA14.Signal=SYS_JTCK-SWCLK
ProjectManager.HeapSize=0x2000
Mcu.Pin15=PH1/OSC_OUT
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
Mcu.Pin16=PF7
Mcu.Pin13=PI0
Mcu.Pin14=PH0/OSC_IN
Mcu.Pin19=PF9
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PF6
PF9.Signal=SPI5_MOSI
RCC.HSI_VALUE=16000000
Mcu.Pin18=PH12
Dma.SPI5_RX.1.MemDataAlignment=DMA_MDATAALIGN_BYTE
RCC.PLLQ=7
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
Mcu.Pin11=PD1
Mcu.Pin12=PA11
RCC.PLLM=6
RCC.PLLN=168
Mcu.Pin10=PG9
Dma.SPI5_RX.1.Priority=DMA_PRIORITY_VERY_HIGH
PB8.Signal=GPXTI8
TIM5.Period=2500-1
RCC.APB1Freq_Value=42000000
PD1.Locked=true
SPI5.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,BaudRatePrescaler
PB0.Signal=GPIO_Output
Dma.SPI5_TX.2.Mode=DMA_NORMAL
PA7.GPIOParameters=GPIO_Speed,GPIO_Label
ProjectManager.DeviceId=STM32F427IIHx
ProjectManager.LibraryCopy=1
SH.S_TIM5_CH1.ConfNb=1
NVIC.CAN1_RX0_IRQn=true\:2\:0\:false\:false\:true\:true\:true\:true
SPI5.Direction=SPI_DIRECTION_2LINES
PA7.Signal=GPIO_Output
Dma.SPI5_RX.1.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode
PA6.Locked=true
